# CLEANING - PROYECTO SQL

Importamos las librerías que puede nos sean necesarias para empezar con la limpieza.

In [1]:
import pandas as pd
import numpy as np
import statistics as stats
import pandas as pd
import numpy as np
import statistics as stats

import warnings
warnings.filterwarnings('ignore')

import pylab as plt
import seaborn as sns

# Cleaning ACTOR

In [2]:
actor = pd.read_csv('../data/actor.csv', encoding = 'latin1')

Importamos el dataframe del csv actor.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [3]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [4]:
actor.duplicated().any()

False

In [5]:
actor.columns

Index(['actor_id', 'first_name', 'last_name', 'last_update'], dtype='object')

In [6]:
actor = actor.rename(columns = {'actor_id': 'Actor_id', 'first_name': 'Name', 'last_name': 'Last_Name', 'last_update': 'Updated'})

In [7]:
actor.columns

Index(['Actor_id', 'Name', 'Last_Name', 'Updated'], dtype='object')

In [8]:
actor.head()

   Actor_id      Name     Last_Name              Updated
0         1  PENELOPE       GUINESS  2006-02-15 04:34:33
1         2      NICK      WAHLBERG  2006-02-15 04:34:33
2         3        ED         CHASE  2006-02-15 04:34:33
3         4  JENNIFER         DAVIS  2006-02-15 04:34:33
4         5    JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [9]:
actor['Name'].isnull().any()

False

In [10]:
actor['Last_Name'].isnull().any()

False

In [11]:
len(actor.Name)

200

In [12]:
len(actor.Last_Name)

200

In [13]:
actor['Name_complete'] = actor['Name'] + ' ' + actor['Last_Name']

In [14]:
actor['Name_complete'].head()

0       PENELOPE GUINESS
1          NICK WAHLBERG
2               ED CHASE
3         JENNIFER DAVIS
4    JOHNNY LOLLOBRIGIDA
Name: Name_complete, dtype: object

In [15]:
actor.head()

   Actor_id      Name     Last_Name              Updated        Name_complete
0         1  PENELOPE       GUINESS  2006-02-15 04:34:33     PENELOPE GUINESS
1         2      NICK      WAHLBERG  2006-02-15 04:34:33        NICK WAHLBERG
2         3        ED         CHASE  2006-02-15 04:34:33             ED CHASE
3         4  JENNIFER         DAVIS  2006-02-15 04:34:33       JENNIFER DAVIS
4         5    JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [16]:
actor.isnull().any()

Actor_id         False
Name             False
Last_Name        False
Updated          False
Name_complete    False
dtype: bool

In [17]:
len(actor.Name_complete)

200

- Ahora que he creado una nueva columna con el nombre completo de los actores, voy a eliminar las columnas de 'Name' y 'Last_Name'

In [18]:
actor = actor.drop(['Name', 'Last_Name'], axis=1)

In [19]:
actor.head()

   Actor_id              Updated        Name_complete
0         1  2006-02-15 04:34:33     PENELOPE GUINESS
1         2  2006-02-15 04:34:33        NICK WAHLBERG
2         3  2006-02-15 04:34:33             ED CHASE
3         4  2006-02-15 04:34:33       JENNIFER DAVIS
4         5  2006-02-15 04:34:33  JOHNNY LOLLOBRIGIDA

In [20]:
actor['Name_complete'].value_counts()

Name_complete
SUSAN DAVIS             2
EWAN GOODING            1
DARYL CRAWFORD          1
GRETA KEITEL            1
JANE JACKMAN            1
                       ..
MICHELLE MCCONAUGHEY    1
ADAM GRANT              1
SEAN WILLIAMS           1
GARY PENN               1
THORA TEMPLE            1
Name: count, Length: 199, dtype: int64

In [21]:

# vemos que SUSAN DAVIS está duplicado

# vamos a eliminar este valor duplicado para que no nos de problemas posteriormente. 

# veo que puedo eliminar la fila donde está el Nombre duplicado, ya que no está el 'Autor_id' en ningún otro DF.

In [22]:
actor['Name_complete'].duplicated().value_counts()

Name_complete
False    199
True       1
Name: count, dtype: int64

In [25]:
actor_dup = actor[actor.duplicated(subset=['Name_complete'], keep='first')]
actor_dup

     Actor_id              Updated Name_complete
109       110  2006-02-15 04:34:33   SUSAN DAVIS

In [26]:
actor = actor.drop_duplicates(subset=['Name_complete'], keep='first')

In [27]:


# una vez que elimino la fila duplicada ya solamente quedan

In [28]:
actor_dup = actor[actor.duplicated(subset=['Name_complete'], keep='first')]
actor_dup

Empty DataFrame
Columns: [Actor_id, Updated, Name_complete]
Index: []

In [29]:
actor['Name_complete'].duplicated().value_counts()

Name_complete
False    199
Name: count, dtype: int64

In [17]:
type('Updated')

str

In [18]:
actor['Updated'] = pd.to_datetime(actor['Updated'])

In [19]:
actor['Date'] = actor['Updated'].dt.date
actor['Time'] = actor['Updated'].dt.time

In [20]:
actor = actor.drop(['Updated', 'Time'], axis=1)

In [21]:
actor.head()

   Actor_id      Name     Last_Name        Name_complete        Date
0         1  PENELOPE       GUINESS     PENELOPE GUINESS  2006-02-15
1         2      NICK      WAHLBERG        NICK WAHLBERG  2006-02-15
2         3        ED         CHASE             ED CHASE  2006-02-15
3         4  JENNIFER         DAVIS       JENNIFER DAVIS  2006-02-15
4         5    JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA  2006-02-15

# Cleaning CATEGORY

In [22]:
cat = pd.read_csv('../data/category.csv', encoding = 'latin1')

Importamos el dataframe del csv category.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [23]:
cat.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [24]:
cat.isnull().any()

category_id    False
name           False
last_update    False
dtype: bool

In [25]:
cat.duplicated().any()

False

In [26]:
cat = cat.drop(['last_update'], axis=1)

In [27]:
cat.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

In [28]:
cat = cat.rename(columns = {'name': 'Category'})

In [29]:
cat.head()

   category_id   Category
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

# Cleaning FILM

Importamos el dataframe del csv film.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [30]:
film_df = pd.read_csv('../data/film.csv', encoding = 'latin1')

In [31]:
film_df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [32]:
film_df.duplicated().any()

False

In [33]:
film_df['language_id'].nunique() == 1

True

In [34]:
film_df['release_year'].nunique() == 1

True

In [35]:
film_df.isnull().any()

film_id                 False
title                   False
description             False
release_year            False
language_id             False
original_language_id     True
rental_duration         False
rental_rate             False
length                  False
replacement_cost        False
rating                  False
special_features        False
last_update             False
dtype: bool

In [36]:
film_df.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'original_language_id', 'rental_duration', 'rental_rate', 'length',
       'replacement_cost', 'rating', 'special_features', 'last_update'],
      dtype='object')

In [37]:
film_df['original_language_id'].isnull().all()

True

### Eliminamos nulos y repetidos

-  Elimino aquellas columnas que tienen valores iguales y repetidos. 

-  Además, la columna 'original_language_id' tiene todos los valores nulos, por lo que también la eliminamos.

In [38]:
film_df = film_df.drop(['release_year', 'language_id', 'original_language_id', 'last_update', 'rental_rate'], axis=1)

In [39]:
film_df.columns

Index(['film_id', 'title', 'description', 'rental_duration', 'length',
       'replacement_cost', 'rating', 'special_features'],
      dtype='object')

In [40]:
film_df.head()

,film_id,title,description,rental_duration,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,130,22.99,G,Deleted Scenes

In [41]:
film_df['special_features'].nunique()

15

### Limpiamos columnas

- Como el titulo de las columnas está en mayúsculas, por si alguno de las letras no es mayúscula, voy a hacer una comprobación y un cambio de todo a MAYÚSCULAS.

In [42]:
if not film_df['title'].str.isupper().all():
    
    film_df['title'] = film_df['title'].str.upper()

In [43]:
if not film_df['special_features'].str.islower().all():
    
    film_df['special_features'] = film_df['special_features'].str.lower()

In [44]:
film_df.head()

,film_id,title,description,rental_duration,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,6,86,20.99,PG,"deleted scenes,behind the scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,3,48,12.99,G,"trailers,deleted scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,7,50,18.99,NC-17,"trailers,deleted scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,5,117,26.99,G,"commentaries,behind the scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,6,130,22.99,G,deleted scenes

# Cleaning INVENTORY

Importamos el dataframe del csv inventory.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

- Elimino aquellas columnas que tienen valores iguales y repetidos.

In [45]:
inv = pd.read_csv('../data/inventory.csv', encoding = 'latin1')

In [46]:
inv.duplicated().any()

False

In [47]:
inv['film_id'].count()

1000

In [48]:
inv.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [49]:
inv = inv.drop(['last_update'], axis=1)

In [50]:
inv.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

# Cleaning LANGUAGE

Importamos el dataframe del csv language.csv

Observamos si tiene: 
 - Duplicados
 - Nulos
 
Renombramos la columna 'name' para que sea más visual y facil de utilizar posteriormente

In [51]:
lang = pd.read_csv('../data/language.csv', encoding = 'latin1')

In [52]:
lang

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [53]:
lang = lang.drop(['last_update'], axis=1)

In [54]:
lang = lang.rename(columns = {'name': 'Language'})

In [55]:
lang

   language_id  Language
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French
5            6    German

# Cleaning old_HDD

Importamos el dataframe del csv language.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [56]:
old = pd.read_csv('../data/old_HDD.csv', encoding = 'latin1')

In [57]:
old.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [58]:
old.duplicated().any()

False

In [59]:
old.isnull().any()

first_name      False
last_name       False
title           False
release_year    False
category_id     False
dtype: bool

In [60]:
old.count()

first_name      1000
last_name       1000
title           1000
release_year    1000
category_id     1000
dtype: int64

In [61]:
old['release_year'].nunique() == 1

True

- Los valores de la columna 'release_year' son únicos, por lo que voy a eliminar esta columna.

In [62]:
old = old.drop(['release_year'], axis=1)

In [63]:
old.columns

Index(['first_name', 'last_name', 'title', 'category_id'], dtype='object')

In [64]:
old = old.rename(columns = {'first_name': 'Name', 'last_name': 'Last_Name', 'title': 'Title'})

In [65]:
old.head()

       Name Last_Name                  Title  category_id
0  PENELOPE   GUINESS       ACADEMY DINOSAUR            6
1  PENELOPE   GUINESS   ANACONDA CONFESSIONS            2
2  PENELOPE   GUINESS            ANGELS LIFE           13
3  PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10
4  PENELOPE   GUINESS          CHEAPER CLYDE           14

In [67]:
old.isnull.any()

AttributeError: 'function' object has no attribute 'any'

In [ ]:
old['Name_complete'] = actor['Name'] + ' ' + actor['Last_Name']

In [ ]:
old.head()

# Cleaning RENTAL

In [ ]:
rent = pd.read_csv('../data/rental.csv', encoding = 'latin1')

In [ ]:
rent.head()

In [ ]:
rent.duplicated().any()

In [ ]:
rent.isnull().any()

- No hay nulos
- No hay filas duplicadas.

In [ ]:
rent = rent.drop(['last_update'], axis=1)

In [ ]:
rent.head()

In [ ]:
column_order = ['rental_id', 'inventory_id', 'customer_id', 'staff_id', 'rental_date', 'return_date']

In [ ]:
rent = rent.reindex(columns=column_order)

In [ ]:
rent.head()

### Observo ahora las columnas de cada uno de los DataFrame, para ver la relación final de todos estos.

In [ ]:
actor.columns

In [ ]:
lang.columns

In [ ]:
film_df.columns

In [ ]:
inv.columns

In [ ]:
cat.columns

In [ ]:
old.columns

In [ ]:
rent.columns